#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

module.network.volcengine_subnet.subnet: Refreshing state... [id=subnet-13f1z238jocu83n6nu5nxs3gh]
module.network.volcengine_vpc.vpc: Refreshing state... [id=vpc-13f1yrehipnnk3n6nu5hrtaxi]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.ecs.random_string.instance_name[0] will be created
  + resource "random_string" "instance_name" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.ecs.volcengine_ecs_instance.foo will be created
  + resource "volcengine_ecs_instance" "foo" {
      + cpus                          = (known after apply)
      + created_at                    = (known after apply)
      + deployment_set_id             = (known after apply)
      + description                   = "Managed by Terraform"
      + gpu_devices                   = (known after apply)
      + host_name                     = (known after apply)
      + id                            = (known after apply)
      + image_id                      = "image-ybqi99s7yq8rx7mnk44b"
      + instance_charge_type          = "PostPaid"
      + instance_id                   = (known after apply)
      + instance_name                 = (known after apply)
      + instance_type                 = "ecs.g1.large"
      + ipv6_address_count            = (known after apply)
      + ipv6_addresses                = (known after apply)
      + is_gpu                        = (known after apply)
      + key_pair_id                   = (known after apply)
      + memory_size                   = (known after apply)
      + network_interface_id          = (known after apply)
      + os_name                       = (known after apply)
      + os_type                       = (known after apply)
      + primary_ip_address            = (known after apply)
      + project_name                  = "default"
      + security_enhancement_strategy = "Active"
      + security_group_ids            = (known after apply)
      + spot_strategy                 = (known after apply)
      + status                        = (known after apply)
      + stopped_mode                  = (known after apply)
      + subnet_id                     = (known after apply)
      + system_volume_id              = (known after apply)
      + system_volume_size            = 40
      + system_volume_type            = "ESSD_PL0"
      + updated_at                    = (known after apply)
      + user_data                     = (known after apply)
      + vpc_id                        = (known after apply)
      + zone_id                       = (known after apply)

      + cpu_options (known after apply)

      + data_volumes (known after apply)

      + secondary_network_interfaces (known after apply)
    }

  # module.ecs.volcengine_eip_associate.foo[0] will be created
  + resource "volcengine_eip_associate" "foo" {
      + allocation_id      = (known after apply)
      + id                 = (known after apply)
      + instance_id        = (known after apply)
      + instance_type      = "EcsInstance"
      + private_ip_address = (known after apply)
    }

  # module.network.volcengine_eip_address.foo will be created
  + resource "volcengine_eip_address" "foo" {
      + bandwidth    = 2
      + billing_type = "PostPaidByBandwidth"
      + deleted_time = (known after apply)
      + eip_address  = (known after apply)
      + expired_time = (known after apply)
      + id           = (known after apply)
      + isp          = (known after apply)
      + name         = "tf-demo-eip"
      + overdue_time = (known after apply)
      + project_name = (known after apply)
      + status       = (known after apply)
    }

  # module.network.volcengine_security_group.foo will be created
  + resource "volcengine_security_group" "foo" {
      + creation_time       = (known after apply)
      + id                  = (known after apply)
      + project_name        = (known after apply)
      + security_group_name = "tf-demo-sg"
      + status              = (known after apply)
      + vpc_id              = (known after apply)
    }

  # module.network.volcengine_subnet.foo will be created
  + resource "volcengine_subnet" "foo" {
      + cidr_block      = "172.16.0.0/24"
      + creation_time   = (known after apply)
      + enable_ipv6     = (known after apply)
      + id              = (known after apply)
      + ipv6_cidr_block = (known after apply)
      + status          = (known after apply)
      + subnet_name     = "tf-test-subnet-demo"
      + vpc_id          = (known after apply)
      + zone_id         = "cn-beijing-a"
    }

  # module.network.volcengine_subnet.subnet will be destroyed
  # (because volcengine_subnet.subnet is not in configuration)
  - resource "volcengine_subnet" "subnet" {
      - cidr_block    = "10.4.0.0/24" -> null
      - creation_time = "2025-01-09T00:00:26+08:00" -> null
      - enable_ipv6   = false -> null
      - id            = "subnet-13f1z238jocu83n6nu5nxs3gh" -> null
      - status        = "Available" -> null
      - subnet_name   = "tf-test-subnet-dev-new" -> null
      - vpc_id        = "vpc-13f1yrehipnnk3n6nu5hrtaxi" -> null
      - zone_id       = "cn-beijing-a" -> null
        # (1 unchanged attribute hidden)
    }

  # module.network.volcengine_vpc.foo will be created
  + resource "volcengine_vpc" "foo" {
      + account_id            = (known after apply)
      + associate_cens        = (known after apply)
      + auxiliary_cidr_blocks = (known after apply)
      + cidr_block            = "172.16.0.0/16"
      + creation_time         = (known after apply)
      + enable_ipv6           = (known after apply)
      + id                    = (known after apply)
      + ipv6_cidr_block       = (known after apply)
      + nat_gateway_ids       = (known after apply)
      + project_name          = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + status                = (known after apply)
      + subnet_ids            = (known after apply)
      + update_time           = (known after apply)
      + vpc_id                = (known after apply)
      + vpc_name              = "tf-test-vpc-demo"
    }

  # module.network.volcengine_vpc.vpc will be destroyed
  # (because volcengine_vpc.vpc is not in configuration)
  - resource "volcengine_vpc" "vpc" {
      - account_id            = "2100049427" -> null
      - associate_cens        = [] -> null
      - auxiliary_cidr_blocks = [] -> null
      - cidr_block            = "10.4.0.0/16" -> null
      - creation_time         = "2025-01-09T00:00:21+08:00" -> null
      - dns_servers           = [] -> null
      - enable_ipv6           = false -> null
      - id                    = "vpc-13f1yrehipnnk3n6nu5hrtaxi" -> null
      - nat_gateway_ids       = [] -> null
      - project_name          = "default" -> null
      - route_table_ids       = [
          - "vtb-13f1yrggjtpmo3n6nu545b4xp",
        ] -> null
      - security_group_ids    = [
          - "sg-13f1yrkem1tkw3n6nu5agvjh2",
        ] -> null
      - status                = "Available" -> null
      - subnet_ids            = [
          - "subnet-13f1z238jocu83n6nu5nxs3gh",
        ] -> null
      - update_time           = "2025-01-09T00:43:17+08:00" -> null
      - vpc_id                = "vpc-13f1yrehipnnk3n6nu5hrtaxi" -> null
      - vpc_name              = "tf-test-vpc-dev-new" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 7 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @msq177, Action: `pull_request`*